[

  {

    "slug": "problem-high-credit-card-fees",

    "title": "Why Are My Credit Card Fees So High?",

    "description": "Your credit card fees are too damn high. Here's why and how to fix it instantly.",

    "solution": "Switch to instant-settlement Solana rails through SideGuy Solutions. Lower fees, faster cash flow, real human help.",

    "category": "money"

  },

  {

    "slug": "problem-stripe-holding-my-money",

    "title": "Why Does Stripe Hold My Money?",

    "description": "Stripe is holding your money because their risk model thinks you're spicy. Here's the fix.",

    "solution": "Solana instant payouts via SideGuy Solutions — 0.4 second settlements, no holds.",

    "category": "payments"

  },

  {

    "slug": "problem-no-customers-coming-in",

    "title": "Why Am I Not Getting More Customers?",

    "description": "Customers aren't showing up because your digital presence is whispering instead of shouting.",

    "solution": "SideGuy builds visibility → clarity → conversion funnels that actually bring people in.",

    "category": "growth"

  },

  {

    "slug": "problem-marketing-not-working",

    "title": "Why Don’t My Ads or Marketing Work?",

    "description": "Your marketing isn't broken — your funnel is. Here's the real reason ads don't work and the SideGuy Fix.",

    "solution": "We build the entire flow: offer → landing page → follow-up → tracking → conversions.",

    "category": "growth"

  },

  {

    "slug": "problem-website-too-slow",

    "title": "Why Is My Website Slow or Broken?",

    "description": "Your website is slow because it's glued together with plugins and duct tape. Here's the real fix.",

    "solution": "SideGuy rebuilds your site clean, modern, fast, and optimized — no plugin chaos.",

    "category": "website"

  },

  {

    "slug": "problem-business-losing-money",

    "title": "Why Isn’t My Business Profitable?",

    "description": "Your business isn't unprofitable — your system is leaking money. Here's how to plug the holes.",

    "solution": "We rebuild your systems: reduce fees, automate tasks, fix offers, and create retention machines.",

    "category": "money"

  },

  {

    "slug": "problem-no-time",

    "title": "Why Do I Never Have Enough Time?",

    "description": "You don't have a time problem — you have a system problem. Here's how SideGuy fixes that.",

    "solution": "We automate your repetitive tasks, remove friction, and give you back hours every week.",

    "category": "operations"

  },

  {

    "slug": "problem-too-many-logins",

    "title": "Why Do I Have 12 Different Logins?",

    "description": "Your business shouldn't require a secret NASA password list. Here's why you have too many logins.",

    "solution": "We consolidate tools into one clean dashboard. One login. One system. One flow.",

    "category": "software"

  },

  {

    "slug": "problem-onboarding-chaos",

    "title": "Why Is Onboarding New Staff So Painful?",

    "description": "Onboarding shouldn't feel like hazing. Here's the real reason it's chaotic and the SideGuy Fix.",

    "solution": "SideGuy builds a clean onboarding flow: dashboard → checklist → zero chaos.",

    "category": "operations"

  },

  {

    "slug": "problem-dont-understand-crypto",

    "title": "Why Does Crypto Feel So Confusing?",

    "description": "Crypto isn't confusing — crypto influencers are. Here's the SideGuy way to simplify everything.",

    "solution": "SideGuy Crypto Help Desk explains everything in plain English and builds simple tools.",

    "category": "crypto"

  }

]